Repository: sarathchandra0007/MegaFlaskApp
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: te

source: Please log in to access this page.
te: Page ni chudadaniki dayachesi log in cheyandi

source: Username
te: Mee peru

source: Remember Me
te: Gurthinchukoo

source: Sign In
te: Sing In

source: Post is live now!!!
te: Mee Post publish cheyabadindi

source: Invalid Username or Password
te: Tappu username mariu password

source: Congratulations you are now a registered user
te: Dhanyavadamulu meeru register ayyaru

source: User %(uname)s not found.
te: User %(uname)s leduu!!

source: Your password has been reset.
te: Mee password marcha badindi

source: Not Found
te: Meeru browse cheyabadina page ledu

source: Back
te: Venukaku

source: %(username)s said %(when)s
te: %(username)s cheppadu %(when)s

source: Welcome to Microblog
te: Microblog ku swagatham
